Revit 2027 API
BuiltInFailures.FormFailures.FormElemRegenSelfIntersection Property
 Unable to create form element: self-intersecting or singular geometry would result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormElemRegenSelfIntersection { get; }
Public Shared ReadOnly Property FormElemRegenSelfIntersection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersection {
	FailureDefinitionId^ get ();
}
static member FormElemRegenSelfIntersection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace